[Killed] StringLiteral
main/components/HelpRequest/HelpRequestTable.js:49:23
         },
         {
             Header: 'TableOrBreakoutRoom',
-            accessor: 'tableOrBreakoutRoom',
+            accessor: "",
         },
         {
killedBy: HelpRequestTable tests Has the expected column headers, content and buttons for admin user
statusReason: TestingLibraryElementError: Unable to find an element by: [data-testid="HelpRequestTable-cell-row-0-col-tableOrBreakoutRoom"]

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >

[Killed] StringLiteral
main/components/HelpRequest/HelpRequestTable.js:60:21
             accessor: 'explanation',
         },
         {
-            Header: 'Solved',
+            Header: "",
             accessor: 'solved',
         }
killedBy: HelpRequestTable tests renders empty table correctly
statusReason: TestingLibraryElementError: Unable to find an element with the text: Solved. This could be because the text is broken up by multiple elements. In this case, you can provide a function for your text matcher to make your matcher more flexible.

<body>
  <div>
    <table
      class="table table-striped table-bordered table-hover"
      role="table"
    >
