[Survived] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:59:42
                             id="itemId"
                             type="number"
                             isInvalid={Boolean(errors.itemId)}
-                            {...register("itemId", { required: true, min: 1 })}
+                            {...register("", { required: true, min: 1 })}
                         />
                         <Form.Control.Feedback type="invalid">

[Survived] EqualityOperator
main/components/MenuItemReview/MenuItemReviewForm.js:63:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.itemId && 'Item ID is required. '}
-                            {errors.itemId?.type === 'min' && 'Item ID is required to be positive. '}
+                            {errors.itemId?.type !== 'min' && 'Item ID is required to be positive. '}
                         </Form.Control.Feedback>
                     </Form.Group>

[Survived] LogicalOperator
main/components/MenuItemReview/MenuItemReviewForm.js:63:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.itemId && 'Item ID is required. '}
-                            {errors.itemId?.type === 'min' && 'Item ID is required to be positive. '}
+                            {errors.itemId?.type === 'min' || 'Item ID is required to be positive. '}
                         </Form.Control.Feedback>
                     </Form.Group>

[Survived] StringLiteral
main/components/MenuItemReview/MenuItemReviewForm.js:94:42
                             id="reviewerEmail"
                             type="text"
                             isInvalid={Boolean(errors.reviewerEmail)}
-                            {...register("reviewerEmail", { required: true, pattern: email_regex })}
+                            {...register("", { required: true, pattern: email_regex })}
                         />
                         <Form.Control.Feedback type="invalid">

[Survived] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:97:30
                             {...register("reviewerEmail", { required: true, pattern: email_regex })}
                         />
                         <Form.Control.Feedback type="invalid">
-                            {errors.reviewerEmail && 'Reviewer email is required. '}
+                            {false}
                             {errors.reviewerEmail?.type === 'pattern' && 'Reviewer email is not an email '}
                         </Form.Control.Feedback>

[Survived] LogicalOperator
main/components/MenuItemReview/MenuItemReviewForm.js:98:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.reviewerEmail && 'Reviewer email is required. '}
-                            {errors.reviewerEmail?.type === 'pattern' && 'Reviewer email is not an email '}
+                            {errors.reviewerEmail?.type === 'pattern' || 'Reviewer email is not an email '}
                         </Form.Control.Feedback>
                     </Form.Group>

[Survived] ConditionalExpression
main/components/MenuItemReview/MenuItemReviewForm.js:98:30
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.reviewerEmail && 'Reviewer email is required. '}
-                            {errors.reviewerEmail?.type === 'pattern' && 'Reviewer email is not an email '}
+                            {false}
                         </Form.Control.Feedback>
                     </Form.Group>

[Survived] OptionalChaining
main/components/MenuItemReview/MenuItemReviewForm.js:114:31
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.stars && 'Stars is required. '}
-                            {(errors.stars?.type === 'min' || errors.stars?.type === 'max') && 'Stars needs to be in between 0 and 5. '}
+                            {(errors.stars.type === 'min' || errors.stars?.type === 'max') && 'Stars needs to be in between 0 and 5. '}
                         </Form.Control.Feedback>
                     </Form.Group>

[Survived] LogicalOperator
main/components/MenuItemReview/MenuItemReviewForm.js:114:31
                         />
                         <Form.Control.Feedback type="invalid">
                             {errors.stars && 'Stars is required. '}
-                            {(errors.stars?.type === 'min' || errors.stars?.type === 'max') && 'Stars needs to be in between 0 and 5. '}
+                            {(errors.stars?.type === 'min' && errors.stars?.type === 'max') && 'Stars needs to be in between 0 and 5. '}
                         </Form.Control.Feedback>
                     </Form.Group>
